In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Import libraries (2)
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [11]:
path = r'C:\Users\agarcia\OneDrive - ITURRI S.A\AGS\Data Analytics Careerfoundy\11-2022 Instacart Grocery Basket Analysis\02 Data\Original Data'

In [12]:
df_customers = pd.read_csv(os.path.join(path, 'customers4_9.csv'),index_col = False)

In [13]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
df_customers.shape

(206209, 10)

## Data Wrangling Procedures and consistency checks

In [16]:
# Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.
# Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; 
# for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [17]:
# not dropping any columns yet (to see if I need them)

In [23]:
#Renaming Columns
df_customers.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', }, inplace = True)

In [24]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [33]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [25]:
df_customers.head(3)

,user_id,first_name,surname,Gender,state,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568

In [26]:
# Changing a Variable’s Data Type
df_customers.describe

<bound method NDFrame.describe of         user_id first_name   surname  Gender           state  Age date_joined  \
0         26711    Deborah  Esquivel  Female        Missouri   48    1/1/2017
1         33890   Patricia      Hart  Female      New Mexico   36    1/1/2017
2         65803    Kenneth    Farley    Male           Idaho   35    1/1/2017
3        125935   Michelle     Hicks  Female            Iowa   40    1/1/2017
4        130797        Ann   Gilmore  Female        Maryland   26    1/1/2017
...         ...        ...       ...     ...             ...  ...         ...
206204   168073       Lisa      Case  Female  North Carolina   44    4/1/2020
206205    49635     Jeremy   Robbins    Male          Hawaii   62    4/1/2020
206206   135902      Doris  Richmond  Female        Missouri   66    4/1/2020
206207    81095       Rose   Rollins  Female      California   27    4/1/2020
206208    80148    Cynthia     Noble  Female        New York   55    4/1/2020

        n_dependants fam_status  income
0                  3    married  165665
1                  0     single   59285
2                  2    married   99568
3                  0     single   42049
4                  1    married   40374
...              ...        ...     ...
206204             1    married  148828
206205             3    married  168639
206206             2    married   53374
206207             1    married   99799
206208             1    married   57095

[206209 rows x 10 columns]>

In [27]:
# changing user_id to string
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [28]:
df_customers['user_id'].dtype

dtype('O')

In [36]:
# Mixed-Type Data
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

In [39]:
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [40]:
# Finding Missing Values
df_customers.isnull().sum()

user_id         0
first_name      0
surname         0
Gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [41]:
# not null values

In [42]:
# Finding Duplicates
df_dups = df_customers[df_customers.duplicated()]

In [43]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, Gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [44]:
# not duplicate values

In [45]:
# Combine your customer data with the rest of your prepared Instacart data. 
#Tip: Make sure the key columns are of the same data type! Hint: Make sure the key columns are the same data type!

In [46]:
path = r'C:\Users\agarcia\OneDrive - ITURRI S.A\AGS\Data Analytics Careerfoundy\11-2022 Instacart Grocery Basket Analysis\02 Data'

In [47]:
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Prepared data', 'orders_products_merged_4_8.pkl'))

In [48]:
ords_prods_merge.head(1)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,_merge,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spending_flag,median_days_spo,frequent_customer_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,both,Mid-range product,Regularly busy days,Average orders,10,New customer,9.0,Low spender,20.5,Non-frequent customer

In [49]:
df_customers.head(1)

,user_id,first_name,surname,Gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665

In [50]:
df_customers['user_id'].dtype

dtype('O')

In [54]:
ords_prods_merge['user_id'].dtype

dtype('int64')

In [56]:
df_customers['user_id'] = df_customers['user_id'].astype('int64')

In [57]:
ords_prods_customers = ords_prods_merge.merge(df_customers, on = 'user_id')

In [58]:
ords_prods_merge.shape

(32404859, 25)

In [59]:
ords_prods_customers.shape

(32404859, 34)

In [60]:
ords_prods_customers.head(2)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,frequent_customer_flag,first_name,surname,Gender,state,age,date_joined,n_dependants,fam_status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [61]:
# Export new merged file as pkl
ords_prods_customers.to_pickle(os.path.join(path,'Prepared Data', 'ords_prods_customers_4_9a.pkl'))